/**
 * Тип алгоритму гешування сертифіката
 */
export type CertHashType = {
  /**
   * Алгоритм гешування ГОСТ34310
   */
  GOST34311: number;

  /**
   * Алгоритм гешування SHA-1
   */
  SHA1: number;

  /**
   * Алгоритм гешування SHA-224
   */
  SHA224: number;

  /**
   * Алгоритм гешування SHA-256
   */
  SHA256: number;

  /**
   * Алгоритм гешування SHA-384
   */
  SHA384: number;

  /**
   * Алгоритм гешування SHA-512
   */
  SHA512: number;

  /**
   * Алгоритм гешування ДСТУ-7564-256
   */
  DSTU7564_256: number;

  /**
   * Алгоритм гешування ДСТУ-7564-384
   */
  DSTU7564_384: number;

  /**
   * Алгоритм гешування ДСТУ-7564-512
   */
  DSTU7564_512: number;
};
