/**
 * Типи форм для відображення в SignWidget (Для самодостатніх форм взаємодії
 * між веб-сайтом та iframe не передбачена)
 */
export type FormType = {
  /**
   * Зчитування ос. ключа. Форма призначена для
   * криптографічних операцій, які потребують ос. ключ користувача, наприклад
   * виконання накладання підпису, шифрування\розшифрування даних.
   */
  ReadPKey: number;

  /**
   * Формування нового сертифікату. Форма призначена для
   * формування нового сертифікату з використанням діючого ос. ключа користувача.
   */
  MakeNewCertificate: number;

  /**
   * Накладання підпису на файл. Форма призначена для
   * накладання підпису на файли та містить необхідні елементи з вибору файлів,
   * алгоритму та типу підпису. Самодостатня форма.
   */
  SignFile: number;

  /**
   * Відображення інформації про сертифікати ос. ключа.
   * Форма призначена для відображення інформації про сертифікати
   * зчитаного ос. ключа. Самодостатня форма.
   */
  ViewPKeyCertificates: number;

  MakeDeviceCertificate: number;
};
