/**
 * Формат підпису
 */
export type SignType = {
  /**
   * Базовий формат підпису. Включає позначку часу
   * від даних та сертифікат підписувача
   */
  CAdES_BES: number;

  /**
   * Підис CAdES_BES, який додатково включає позначку
   * часу від ЕЦП
   */
  CAdES_T: number;

  /**
   * Підпис CAdES-T, який додатково включає посилання
   * на повний набір сертифікатів для перевірки підпису
   */
  CAdES_C: number;

  /**
   * Підпис CAdES-C, який додатково включає повний набір
   * сертифікатів ЦСК для перевірки підпису, а також відповіді від OCSP сервера
   * зі статусом сертифіката підписувача
   */
  CAdES_X_Long: number;
};
