/**
 * Формат підпису XAdES
 */
export type XAdESSignLevel = {
  /**
   * Базовий формат підпису
   */
  XAdES_B_B: number;

  /**
   * Підис XAdES_B_B, який додатково включає позначку
   * часу від ЕЦП
   */
  XAdES_B_T: number;

  /**
   * Підис XAdES_B_T, який додатково включає набір
   * сертифікатів ЦСК для перевірки підпису для довгострокового зберігання
   */
  XAdES_B_LT: number;

  /**
   * Підис XAdES_B_LT, який додатково включає
   * архівну позначку часу
   */
  XAdES_B_LTA: number;
};
